OpenFOAM-7/tutorials/combustion/coldEngineFoam/freePiston/constant/engineGeometry
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      engineGeometry;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

engineMesh      layered;

engineType  freePiston;

pistonPositionTime  table
(
    (0 0.13)
    (0.020 0.013)
);


// ************************************************************************* //
